Repository: Klevin-G/BrassTune
Catalog: swift/BrassTuneApp/BrassTuneApp/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, ja, ko, pt_br, ru, vi, zh_hans, zh_hant

source: %@ minutes
ar: %@ دقيقة
de: %@ Minuten
es: %@ minutos
ja: %@分
ko: %@분
pt_br: %@ minutos
ru: %@ мин
vi: %@ phút
zh_hans: %@ 分钟
zh_hant: %@ 分鐘

source: Account sign-in needs secure service configuration. You can keep practicing as a guest.
ar: يتطلب تسجيل الدخول إلى الحساب إعدادًا آمنًا للخدمة. يمكنك مواصلة التدريب كضيف.
de: Die Kontoanmeldung benötigt eine sichere Dienstkonfiguration. Du kannst als Gast weiterüben.
es: El inicio de sesión necesita una configuración segura del servicio. Puedes seguir practicando como invitado.
fr: La connexion au compte nécessite une configuration sécurisée du service. Vous pouvez continuer en tant qu’invité.
ja: アカウントのサインインには安全なサービス設定が必要です。ゲストとして練習を続けられます。
ko: 계정 로그인에는 안전한 서비스 구성이 필요합니다. 게스트로 계속 연습할 수 있습니다.
pt_br: O início de sessão precisa de configuração segura do serviço. Você pode continuar praticando como convidado.
ru: Для входа в аккаунт нужна безопасная настройка сервиса. Можно продолжить занятия как гость.
vi: Đăng nhập tài khoản cần cấu hình dịch vụ bảo mật. Bạn có thể tiếp tục luyện tập với tư cách khách.
zh_hans: 账户登录需要安全的服务配置。你可以继续以访客身份练习。
zh_hant: 帳戶登入需要安全的服務設定。你可以繼續以訪客身分練習。

source: Apple and Google
ar: Apple وGoogle
de: Apple und Google
es: Apple y Google
fr: Apple et Google
ja: AppleとGoogle
ko: Apple 및 Google
pt_br: Apple e Google
ru: Apple и Google
vi: Apple và Google
zh_hans: Apple 和 Google
zh_hant: Apple 和 Google

source: Apple and Google sign-in need provider setup. Email and password still work.
ar: يتطلب تسجيل الدخول عبر Apple وGoogle إعداد موفري الخدمة. لا يزال البريد الإلكتروني وكلمة المرور يعملان.
de: Die Anmeldung mit Apple und Google benötigt eine Anbieter-Einrichtung. E-Mail und Passwort funktionieren weiterhin.
es: El inicio con Apple y Google requiere configurar los proveedores. El correo y la contraseña siguen funcionando.
fr: La connexion avec Apple et Google nécessite la configuration des fournisseurs. L’e-mail et le mot de passe fonctionnent toujours.
ja: AppleとGoogleでのサインインにはプロバイダ設定が必要です。メールとパスワードは引き続き使用できます。
ko: Apple 및 Google 로그인에는 제공업체 설정이 필요합니다. 이메일과 비밀번호는 계속 사용할 수 있습니다.
pt_br: O início de sessão com Apple e Google precisa de configuração dos provedores. E-mail e senha continuam funcionando.
ru: Для входа через Apple и Google нужна настройка провайдеров. Электронная почта и пароль по-прежнему работают.
vi: Đăng nhập bằng Apple và Google cần thiết lập nhà cung cấp. Email và mật khẩu vẫn hoạt động.
zh_hans: Apple 和 Google 登录需要配置提供商。电子邮件和密码仍可使用。
zh_hant: Apple 和 Google 登入需要設定提供者。電子郵件和密碼仍可使用。

source: BrassTune couldn't check Apple and Google sign-in. Retry or use email and password.
ar: تعذر على BrassTune التحقق من تسجيل الدخول عبر Apple وGoogle. أعد المحاولة أو استخدم البريد الإلكتروني وكلمة المرور.
de: BrassTune konnte die Apple- und Google-Anmeldung nicht prüfen. Versuche es erneut oder nutze E-Mail und Passwort.
es: BrassTune no pudo comprobar el inicio con Apple y Google. Reintenta o usa el correo y la contraseña.
fr: BrassTune n’a pas pu vérifier la connexion Apple et Google. Réessayez ou utilisez l’e-mail et le mot de passe.
ja: AppleとGoogleでのサインインを確認できませんでした。再試行するか、メールとパスワードを使用してください。
ko: Apple 및 Google 로그인을 확인할 수 없습니다. 다시 시도하거나 이메일과 비밀번호를 사용하세요.
pt_br: O BrassTune não pôde verificar o início com Apple e Google. Tente novamente ou use e-mail e senha.
ru: BrassTune не удалось проверить вход через Apple и Google. Повторите попытку или используйте почту и пароль.
vi: BrassTune không thể kiểm tra đăng nhập Apple và Google. Thử lại hoặc dùng email và mật khẩu.
zh_hans: BrassTune 无法检查 Apple 和 Google 登录。请重试或使用电子邮件和密码。
zh_hant: BrassTune 無法檢查 Apple 和 Google 登入。請重試或使用電子郵件和密碼。

source: Checking sign-in providers…
ar: جارٍ التحقق من موفري تسجيل الدخول…
de: Anmeldeanbieter werden geprüft…
es: Comprobando proveedores de inicio…
fr: Vérification des fournisseurs de connexion…
ja: サインインプロバイダを確認中…
ko: 로그인 제공업체 확인 중…
pt_br: Verificando provedores de início…
ru: Проверка провайдеров входа…
vi: Đang kiểm tra nhà cung cấp đăng nhập…
zh_hans: 正在检查登录提供商…
zh_hant: 正在檢查登入提供者…

source: Google sign-in was cancelled.
ar: تم إلغاء تسجيل الدخول عبر Google.
de: Die Google-Anmeldung wurde abgebrochen.
es: Se canceló el inicio de sesión con Google.
fr: La connexion avec Google a été annulée.
ja: Googleでのサインインがキャンセルされました。
ko: Google 로그인이 취소되었습니다.
pt_br: O início de sessão com o Google foi cancelado.
ru: Вход через Google отменён.
vi: Đã hủy đăng nhập bằng Google.
zh_hans: 已取消使用 Google 登录。
zh_hant: 已取消使用 Google 登入。

source: One sign-in provider needs setup. Use an available provider or email and password.
ar: يحتاج أحد موفري تسجيل الدخول إلى الإعداد. استخدم موفرًا متاحًا أو البريد الإلكتروني وكلمة المرور.
de: Ein Anmeldeanbieter muss eingerichtet werden. Nutze einen verfügbaren Anbieter oder E-Mail und Passwort.
es: Un proveedor de inicio necesita configuración. Usa uno disponible o el correo y la contraseña.
fr: Un fournisseur de connexion doit être configuré. Utilisez un fournisseur disponible ou l’e-mail et le mot de passe.
ja: 1つのサインインプロバイダに設定が必要です。利用可能なプロバイダかメールとパスワードを使用してください。
ko: 로그인 제공업체 하나에 설정이 필요합니다. 사용 가능한 제공업체 또는 이메일과 비밀번호를 사용하세요.
pt_br: Um provedor de início precisa ser configurado. Use um provedor disponível ou e-mail e senha.
ru: Один провайдер входа требует настройки. Используйте доступный провайдер или почту и пароль.
vi: Một nhà cung cấp đăng nhập cần thiết lập. Hãy dùng nhà cung cấp có sẵn hoặc email và mật khẩu.
zh_hans: 一个登录提供商需要配置。请使用可用的提供商或电子邮件和密码。
zh_hant: 一個登入提供者需要設定。請使用可用的提供者或電子郵件和密碼。

source: Retry provider check
ar: إعادة التحقق من الموفر
de: Anbieter erneut prüfen
es: Reintentar comprobación
fr: Revérifier les fournisseurs
ja: プロバイダを再確認
ko: 제공업체 다시 확인
pt_br: Verificar provedores novamente
ru: Повторить проверку
vi: Kiểm tra lại nhà cung cấp
zh_hans: 重新检查提供商
zh_hant: 重新檢查提供者

source: Sign in with Google
ar: تسجيل الدخول باستخدام Google
de: Mit Google anmelden
es: Iniciar sesión con Google
fr: Se connecter avec Google
ja: Googleでログイン
ko: Google로 로그인
pt_br: Entrar com o Google
ru: Войти через Google
vi: Đăng nhập bằng Google
zh_hans: 使用 Google 登录
zh_hant: 使用 Google 登入

source: Signed in with Google.
ar: تم تسجيل الدخول عبر Google.
de: Mit Google angemeldet.
es: Sesión iniciada con Google.
fr: Connecté avec Google.
ja: Googleでサインインしました。
ko: Google로 로그인했습니다.
pt_br: Sessão iniciada com o Google.
ru: Вход через Google выполнен.
vi: Đã đăng nhập bằng Google.
zh_hans: 已使用 Google 登录。
zh_hant: 已使用 Google 登入。

source: That sign-in provider is not available right now. Try another sign-in method or keep practicing as a guest.
ar: موفر تسجيل الدخول هذا غير متاح الآن. جرّب طريقة أخرى أو واصل التدريب كضيف.
de: Dieser Anmeldeanbieter ist gerade nicht verfügbar. Nutze eine andere Methode oder übe als Gast weiter.
es: Ese proveedor no está disponible ahora. Prueba otro método o sigue practicando como invitado.
fr: Ce fournisseur de connexion est indisponible pour le moment. Essayez une autre méthode ou continuez en tant qu’invité.
ja: このサインインプロバイダは現在利用できません。別の方法を試すか、ゲストとして練習を続けてください。
ko: 이 로그인 제공업체는 지금 사용할 수 없습니다. 다른 방법을 시도하거나 게스트로 계속 연습하세요.
pt_br: Esse provedor não está disponível agora. Tente outro método ou continue praticando como convidado.
ru: Этот провайдер входа сейчас недоступен. Попробуйте другой способ или продолжите как гость.
vi: Nhà cung cấp đăng nhập này hiện không khả dụng. Hãy thử cách khác hoặc tiếp tục với tư cách khách.
zh_hans: 此登录提供商当前不可用。请尝试其他登录方式或继续以访客身份练习。
zh_hant: 此登入提供者目前無法使用。請嘗試其他登入方式或繼續以訪客身分練習。

source: The sign-in callback could not be verified. Start sign-in again.
ar: تعذر التحقق من استدعاء تسجيل الدخول. ابدأ تسجيل الدخول من جديد.
de: Der Anmelderückruf konnte nicht geprüft werden. Starte die Anmeldung erneut.
es: No se pudo verificar la devolución del inicio. Inicia sesión de nuevo.
fr: Le retour de connexion n’a pas pu être vérifié. Recommencez la connexion.
ja: サインインのコールバックを確認できませんでした。もう一度サインインしてください。
ko: 로그인 콜백을 확인할 수 없습니다. 로그인을 다시 시작하세요.
pt_br: Não foi possível verificar o retorno do início. Comece o início de sessão novamente.
ru: Не удалось проверить возврат входа. Начните вход заново.
vi: Không thể xác minh lệnh gọi lại đăng nhập. Hãy bắt đầu đăng nhập lại.
zh_hans: 无法验证登录回调。请重新开始登录。
zh_hant: 無法驗證登入回呼。請重新開始登入。

source: You
ar: أنت
de: Du
es: Tú
fr: Vous
ja: あなた
ko: 나
pt_br: Você
ru: Вы
vi: Bạn
zh_hans: 你
zh_hant: 你

source: A new class code is ready. The previous code no longer works.
ar: رمز صف جديد جاهز. لم يعد الرمز السابق صالحًا.
de: Ein neuer Kurscode ist bereit. Der vorherige Code funktioniert nicht mehr.
es: Hay un nuevo código de clase. El código anterior ya no funciona.
fr: Un nouveau code de classe est prêt. L’ancien code ne fonctionne plus.
ja: 新しいクラスコードを発行しました。以前のコードは使用できません。
ko: 새 수업 코드가 준비되었습니다. 이전 코드는 더 이상 작동하지 않습니다.
pt_br: Um novo código de turma está pronto. O código anterior não funciona mais.
ru: Новый код класса готов. Предыдущий код больше не работает.
vi: Mã lớp mới đã sẵn sàng. Mã trước không còn hoạt động.
zh_hans: 新班级代码已生成。原代码不再有效。
zh_hant: 新的班級代碼已產生。原代碼不再有效。

source: Accept invitation
ar: قبول الدعوة
de: Einladung annehmen
es: Aceptar invitación
fr: Accepter l’invitation
ja: 招待を承認
ko: 초대 수락
pt_br: Aceitar convite
ru: Принять приглашение
vi: Chấp nhận lời mời
zh_hans: 接受邀请
zh_hant: 接受邀請

source: Aggregate activity since each student joined.
ar: النشاط الإجمالي منذ انضمام كل طالب.
de: Zusammengefasste Aktivität seit dem Beitritt jedes Schülers.
es: Actividad agregada desde que se unió cada estudiante.
fr: Activité agrégée depuis l’arrivée de chaque élève.
ja: 各生徒が参加してからの集計アクティビティ。
ko: 각 학생이 참여한 이후의 집계 활동입니다.
pt_br: Atividade agregada desde a entrada de cada aluno.
ru: Сводная активность с момента вступления каждого ученика.
vi: Hoạt động tổng hợp kể từ khi từng học sinh tham gia.
zh_hans: 每位学生加入后的汇总活动。
zh_hant: 每位學生加入後的彙總活動。

source: Choose your instrument before accepting.
ar: اختر آلتك قبل القبول.
de: Wähle vor dem Annehmen dein Instrument.
es: Elige tu instrumento antes de aceptar.
fr: Choisissez votre instrument avant d’accepter.
ja: 承認する前に楽器を選んでください。
ko: 수락하기 전에 악기를 선택하세요.
pt_br: Escolha seu instrumento antes de aceitar.
ru: Выберите инструмент перед принятием.
vi: Chọn nhạc cụ trước khi chấp nhận.
zh_hans: 接受前请选择你的乐器。
zh_hant: 接受前請選擇你的樂器。

source: Class code %@
ar: رمز الصف %@
de: Kurscode %@
es: Código de clase %@
fr: Code de classe %@
ja: クラスコード %@
ko: 수업 코드 %@
pt_br: Código da turma %@
ru: Код класса %@
vi: Mã lớp %@
zh_hans: 班级代码 %@
zh_hant: 班級代碼 %@

source: Class invitations
ar: دعوات الصف
de: Kurseinladungen
es: Invitaciones a clases
fr: Invitations aux classes
ja: クラスへの招待
ko: 수업 초대
pt_br: Convites para turmas
ru: Приглашения в классы
vi: Lời mời vào lớp
zh_hans: 班级邀请
zh_hant: 班級邀請

source: Class name
ar: اسم الصف
de: Kursname
es: Nombre de la clase
fr: Nom de la classe
ja: クラス名
ko: 수업 이름
pt_br: Nome da turma
ru: Название класса
vi: Tên lớp
zh_hans: 班级名称
zh_hant: 班級名稱

source: Collapsed
ar: مطوي
de: Eingeklappt
es: Contraído
fr: Réduit
ja: 折りたたみ
ko: 접힘
pt_br: Recolhido
ru: Свернуто
vi: Đã thu gọn
zh_hans: 已折叠
zh_hant: 已收合

source: Create a class
ar: إنشاء صف
de: Kurs erstellen
es: Crear una clase
fr: Créer une classe
ja: クラスを作成
ko: 수업 만들기
pt_br: Criar uma turma
ru: Создать класс
vi: Tạo lớp
zh_hans: 创建班级
zh_hant: 建立班級

source: Created %@.
ar: تم إنشاء %@.
de: %@ wurde erstellt.
es: Se creó %@.
fr: %@ a été créé.
ja: %@を作成しました。
ko: %@을(를) 만들었습니다.
pt_br: %@ foi criada.
ru: Создано: %@.
vi: Đã tạo %@.
zh_hans: 已创建 %@。
zh_hant: 已建立 %@。

source: Creating…
ar: جارٍ الإنشاء…
de: Wird erstellt…
es: Creando…
fr: Création…
ja: 作成中…
ko: 만드는 중…
pt_br: Criando…
ru: Создание…
vi: Đang tạo…
zh_hans: 正在创建…
zh_hant: 正在建立…

source: Decline invitation
ar: رفض الدعوة
de: Einladung ablehnen
es: Rechazar invitación
fr: Refuser l’invitation
ja: 招待を辞退
ko: 초대 거절
pt_br: Recusar convite
ru: Отклонить приглашение
vi: Từ chối lời mời
zh_hans: 拒绝邀请
zh_hant: 拒絕邀請

source: Declined the invitation to %@.
ar: تم رفض دعوة %@.
de: Einladung zu %@ abgelehnt.
es: Rechazaste la invitación a %@.
fr: Invitation à %@ refusée.
ja: %@への招待を辞退しました。
ko: %@ 초대를 거절했습니다.
pt_br: Convite para %@ recusado.
ru: Приглашение в %@ отклонено.
vi: Đã từ chối lời mời vào %@.
zh_hans: 已拒绝加入 %@ 的邀请。
zh_hant: 已拒絕加入 %@ 的邀請。

source: Enter a class name with 2-80 characters.
ar: أدخل اسم صف يتكون من 2 إلى 80 حرفًا.
de: Gib einen Kursnamen mit 2–80 Zeichen ein.
es: Escribe un nombre de clase de 2 a 80 caracteres.
fr: Saisissez un nom de classe de 2 à 80 caractères.
ja: 2～80文字のクラス名を入力してください。
ko: 2~80자의 수업 이름을 입력하세요.
pt_br: Digite um nome de turma com 2 a 80 caracteres.
ru: Введите название класса длиной от 2 до 80 символов.
vi: Nhập tên lớp dài 2–80 ký tự.
zh_hans: 请输入 2–80 个字符的班级名称。
zh_hant: 請輸入 2–80 個字元的班級名稱。

source: Enter a valid username using letters, numbers, underscores, or hyphens.
ar: أدخل اسم مستخدم صالحًا باستخدام الأحرف أو الأرقام أو الشرطات السفلية أو الواصلات.
de: Gib einen gültigen Benutzernamen mit Buchstaben, Zahlen, Unter- oder Bindestrichen ein.
es: Escribe un usuario válido con letras, números, guiones bajos o guiones.
fr: Saisissez un nom d’utilisateur valide avec des lettres, chiffres, tirets bas ou tirets.
ja: 英字、数字、アンダースコア、ハイフンを使った有効なユーザー名を入力してください。
ko: 문자, 숫자, 밑줄 또는 하이픈을 사용한 올바른 사용자 이름을 입력하세요.
pt_br: Digite um nome de usuário válido com letras, números, sublinhados ou hífens.
ru: Введите допустимое имя пользователя из букв, цифр, подчёркиваний или дефисов.
vi: Nhập tên người dùng hợp lệ bằng chữ, số, dấu gạch dưới hoặc gạch nối.
zh_hans: 请输入由字母、数字、下划线或连字符组成的有效用户名。
zh_hant: 請輸入由字母、數字、底線或連字號組成的有效使用者名稱。

source: Expanded
ar: موسّع
de: Ausgeklappt
es: Expandido
fr: Développé
ja: 展開
ko: 펼침
pt_br: Expandido
ru: Развернуто
vi: Đã mở rộng
zh_hans: 已展开
zh_hant: 已展開

source: Invitation sent to %@.
ar: تم إرسال الدعوة إلى %@.
de: Einladung an %@ gesendet.
es: Invitación enviada a %@.
fr: Invitation envoyée à %@.
ja: %@に招待を送信しました。
ko: %@에게 초대를 보냈습니다.
pt_br: Convite enviado para %@.
ru: Приглашение отправлено пользователю %@.
vi: Đã gửi lời mời tới %@.
zh_hans: 已向 %@ 发送邀请。
zh_hant: 已向 %@ 傳送邀請。

source: Invite students
ar: دعوة الطلاب
de: Schüler einladen
es: Invitar estudiantes
fr: Inviter des élèves
ja: 生徒を招待
ko: 학생 초대
pt_br: Convidar alunos
ru: Пригласить учеников
vi: Mời học sinh
zh_hans: 邀请学生
zh_hant: 邀請學生

source: Invited
ar: مدعو
de: Eingeladen
es: Invitado
fr: Invité
ja: 招待済み
ko: 초대됨
pt_br: Convidado
ru: Приглашён
vi: Đã mời
zh_hans: 已邀请
zh_hant: 已邀請

source: Invited by %@
ar: الدعوة من %@
de: Eingeladen von %@
es: Invitación de %@
fr: Invitation de %@
ja: %@からの招待
ko: %@ 님의 초대
pt_br: Convite de %@
ru: Приглашение от %@
vi: Được %@ mời
zh_hans: 由 %@ 邀请
zh_hant: 由 %@ 邀請

source: Join %@ with class code %@.
ar: انضم إلى %@ باستخدام رمز الصف %@.
de: Tritt %@ mit dem Kurscode %@ bei.
es: Únete a %@ con el código de clase %@.
fr: Rejoignez %@ avec le code de classe %@.
ja: クラスコード%@で%@に参加してください。
ko: 수업 코드 %@을(를) 사용하여 %@에 참여하세요.
pt_br: Entre em %@ com o código da turma %@.
ru: Присоединяйтесь к %@ с кодом класса %@.
vi: Tham gia %@ bằng mã lớp %@.
zh_hans: 使用班级代码 %@ 加入 %@。
zh_hant: 使用班級代碼 %@ 加入 %@。

source: Joined %@.
ar: انضممت إلى %@.
de: %@ beigetreten.
es: Te uniste a %@.
fr: Vous avez rejoint %@.
ja: %@に参加しました。
ko: %@에 참여했습니다.
pt_br: Você entrou em %@.
ru: Вы вступили в %@.
vi: Đã tham gia %@.
zh_hans: 已加入 %@。
zh_hant: 已加入 %@。

source: Left %@.
ar: غادرت %@.
de: %@ verlassen.
es: Saliste de %@.
fr: Vous avez quitté %@.
ja: %@から退出しました。
ko: %@에서 나왔습니다.
pt_br: Você saiu de %@.
ru: Вы вышли из %@.
vi: Đã rời %@.
zh_hans: 已退出 %@。
zh_hant: 已退出 %@。

source: Loading roster…
ar: جارٍ تحميل قائمة الطلاب…
de: Teilnehmerliste wird geladen…
es: Cargando lista…
fr: Chargement de la liste…
ja: 名簿を読み込み中…
ko: 명단 불러오는 중…
pt_br: Carregando lista…
ru: Загрузка списка…
vi: Đang tải danh sách…
zh_hans: 正在加载名单…
zh_hant: 正在載入名單…

source: Member removed.
ar: تمت إزالة العضو.
de: Mitglied entfernt.
es: Miembro eliminado.
fr: Membre supprimé.
ja: メンバーを削除しました。
ko: 구성원을 삭제했습니다.
pt_br: Membro removido.
ru: Участник удалён.
vi: Đã xóa thành viên.
zh_hans: 已移除成员。
zh_hant: 已移除成員。

source: Membership
ar: العضوية
de: Mitgliedschaft
es: Membresía
fr: Membres
ja: メンバー
ko: 구성원
pt_br: Participação
ru: Участники
vi: Thành viên
zh_hans: 成员
zh_hant: 成員

source: Membership and aggregate practice activity.
ar: العضوية ونشاط التدريب الإجمالي.
de: Mitgliedschaft und zusammengefasste Übungsaktivität.
es: Membresía y actividad de práctica agregada.
fr: Membres et activité de pratique agrégée.
ja: メンバーと練習アクティビティの集計。
ko: 구성원 및 집계 연습 활동입니다.
pt_br: Participação e atividade de prática agregada.
ru: Участники и сводная активность занятий.
vi: Thành viên và hoạt động luyện tập tổng hợp.
zh_hans: 成员及汇总练习活动。
zh_hant: 成員及彙總練習活動。

source: No students yet.
ar: لا يوجد طلاب بعد.
de: Noch keine Schüler.
es: Aún no hay estudiantes.
fr: Aucun élève pour le moment.
ja: まだ生徒はいません。
ko: 아직 학생이 없습니다.
pt_br: Ainda não há alunos.
ru: Учеников пока нет.
vi: Chưa có học sinh.
zh_hans: 还没有学生。
zh_hant: 還沒有學生。

source: Only class-level and student aggregate practice minutes, session counts, and tuning summaries are shared.
ar: لا تتم مشاركة سوى دقائق التدريب الإجمالية وعدد الجلسات وملخصات الضبط على مستوى الصف والطالب.
de: Geteilt werden nur zusammengefasste Übungsminuten, Sitzungszahlen und Stimmübersichten für Kurs und Schüler.
es: Solo se comparten minutos de práctica, cantidad de sesiones y resúmenes de afinación agregados de la clase y cada estudiante.
fr: Seuls les minutes de pratique, nombres de séances et résumés d’accordage agrégés de la classe et des élèves sont partagés.
ja: クラスと生徒ごとの練習時間、セッション数、チューニング概要の集計だけが共有されます。
ko: 수업 및 학생별 집계 연습 시간, 세션 수, 튜닝 요약만 공유됩니다.
pt_br: Apenas minutos de prática, contagens de sessões e resumos de afinação agregados da turma e dos alunos são compartilhados.
ru: Передаются только сводные минуты занятий, число сессий и итоги настройки по классу и ученикам.
vi: Chỉ chia sẻ số phút luyện tập, số buổi và tóm tắt chỉnh dây tổng hợp của lớp và học sinh.
zh_hans: 仅共享班级和学生的汇总练习分钟数、练习次数和调音摘要。
zh_hant: 僅分享班級和學生的彙總練習分鐘數、練習次數和調音摘要。

source: Only the roster details permitted for your role are shown.
ar: لا تظهر سوى تفاصيل قائمة الطلاب المسموح بها لدورك.
de: Es werden nur die für deine Rolle erlaubten Listendetails angezeigt.
es: Solo se muestran los datos de la lista permitidos para tu función.
fr: Seuls les détails de la liste autorisés pour votre rôle sont affichés.
ja: あなたの役割で許可された名簿情報だけが表示されます。
ko: 역할에 허용된 명단 정보만 표시됩니다.
pt_br: Apenas os detalhes da lista permitidos para sua função são exibidos.
ru: Показываются только данные списка, доступные для вашей роли.
vi: Chỉ hiển thị thông tin danh sách được phép cho vai trò của bạn.
zh_hans: 仅显示你的角色有权查看的名单信息。
zh_hant: 僅顯示你的角色有權查看的名單資訊。

source: Practice as a guest today. Online backup and Classes will appear when account access is available.
ar: تدرّب كضيف اليوم. سيظهر النسخ الاحتياطي عبر الإنترنت والصفوف عند توفر الوصول إلى الحساب.
de: Übe heute als Gast. Online-Backup und Kurse erscheinen, sobald der Kontozugriff verfügbar ist.
es: Practica hoy como invitado. La copia en línea y las Clases aparecerán cuando esté disponible el acceso a la cuenta.
fr: Entraînez-vous aujourd’hui en tant qu’invité. La sauvegarde en ligne et les Classes apparaîtront quand l’accès au compte sera disponible.
ja: 今日はゲストとして練習できます。アカウントが利用可能になると、オンラインバックアップとクラスが表示されます。
ko: 오늘은 게스트로 연습하세요. 계정을 사용할 수 있게 되면 온라인 백업과 수업이 표시됩니다.
pt_br: Pratique hoje como convidado. O backup on-line e as Turmas aparecerão quando o acesso à conta estiver disponível.
ru: Сегодня можно заниматься как гость. Облачная копия и Классы появятся, когда будет доступен вход в аккаунт.
vi: Hôm nay hãy luyện tập với tư cách khách. Sao lưu trực tuyến và Lớp học sẽ xuất hiện khi có quyền truy cập tài khoản.
zh_hans: 今天可先以访客身份练习。账户可用后，在线备份和班级功能会自动出现。
zh_hant: 今天可先以訪客身分練習。帳戶可用後，線上備份和班級功能會自動出現。

source: Practice is ready
ar: التدريب جاهز
de: Üben ist bereit
es: La práctica está lista
fr: La pratique est prête
ja: 練習の準備ができました
ko: 연습 준비 완료
pt_br: A prática está pronta
ru: Всё готово к занятию
vi: Đã sẵn sàng luyện tập
zh_hans: 练习已就绪
zh_hant: 練習已就緒

source: Recordings, live microphone audio, imported sheet music, and private reflections are never shown here.
ar: لا تظهر هنا مطلقًا التسجيلات أو صوت الميكروفون المباشر أو النوتات المستوردة أو الملاحظات الخاصة.
de: Aufnahmen, Live-Mikrofonton, importierte Noten und private Reflexionen werden hier nie angezeigt.
es: Aquí nunca se muestran grabaciones, audio del micrófono en vivo, partituras importadas ni reflexiones privadas.
fr: Les enregistrements, l’audio en direct du micro, les partitions importées et les réflexions privées ne sont jamais affichés ici.
ja: 録音、マイクのライブ音声、読み込んだ楽譜、非公開の振り返りがここに表示されることはありません。
ko: 녹음, 실시간 마이크 오디오, 가져온 악보, 비공개 회고는 여기에 표시되지 않습니다.
pt_br: Gravações, áudio ao vivo do microfone, partituras importadas e reflexões privadas nunca aparecem aqui.
ru: Записи, звук с микрофона, импортированные ноты и личные заметки здесь никогда не показываются.
vi: Bản ghi âm, âm thanh micrô trực tiếp, bản nhạc đã nhập và ghi chú riêng tư không bao giờ hiển thị ở đây.
zh_hans: 录音、实时麦克风音频、导入的乐谱和私人反思绝不会显示在这里。
zh_hant: 錄音、即時麥克風音訊、匯入的樂譜和私人反思絕不會顯示在這裡。

source: Remove member
ar: إزالة العضو
de: Mitglied entfernen
es: Eliminar miembro
fr: Supprimer le membre
ja: メンバーを削除
ko: 구성원 삭제
pt_br: Remover membro
ru: Удалить участника
vi: Xóa thành viên
zh_hans: 移除成员
zh_hant: 移除成員

source: Remove this class member?
ar: إزالة هذا العضو من الصف؟
de: Dieses Kursmitglied entfernen?
es: ¿Eliminar a este miembro de la clase?
fr: Supprimer ce membre de la classe ?
ja: このクラスのメンバーを削除しますか？
ko: 이 수업 구성원을 삭제할까요?
pt_br: Remover este membro da turma?
ru: Удалить этого участника класса?
vi: Xóa thành viên này khỏi lớp?
zh_hans: 移除此班级成员？
zh_hant: 移除此班級成員？

source: Replace class code
ar: استبدال رمز الصف
de: Kurscode ersetzen
es: Reemplazar código de clase
fr: Remplacer le code de classe
ja: クラスコードを変更
ko: 수업 코드 바꾸기
pt_br: Substituir código da turma
ru: Заменить код класса
vi: Thay mã lớp
zh_hans: 更换班级代码
zh_hant: 更換班級代碼

source: Replace code
ar: استبدال الرمز
de: Code ersetzen
es: Reemplazar código
fr: Remplacer le code
ja: コードを変更
ko: 코드 바꾸기
pt_br: Substituir código
ru: Заменить код
vi: Thay mã
zh_hans: 更换代码
zh_hant: 更換代碼

source: Replace the class code?
ar: استبدال رمز الصف؟
de: Den Kurscode ersetzen?
es: ¿Reemplazar el código de clase?
fr: Remplacer le code de classe ?
ja: クラスコードを変更しますか？
ko: 수업 코드를 바꿀까요?
pt_br: Substituir o código da turma?
ru: Заменить код класса?
vi: Thay mã lớp?
zh_hans: 更换班级代码？
zh_hant: 更換班級代碼？

source: Roster summary
ar: ملخص قائمة الطلاب
de: Listenübersicht
es: Resumen de la lista
fr: Résumé de la liste
ja: 名簿の概要
ko: 명단 요약
pt_br: Resumo da lista
ru: Сводка списка
vi: Tóm tắt danh sách
zh_hans: 名单摘要
zh_hant: 名單摘要

source: Send invitation
ar: إرسال الدعوة
de: Einladung senden
es: Enviar invitación
fr: Envoyer l’invitation
ja: 招待を送信
ko: 초대 보내기
pt_br: Enviar convite
ru: Отправить приглашение
vi: Gửi lời mời
zh_hans: 发送邀请
zh_hant: 傳送邀請

source: Sending…
ar: جارٍ الإرسال…
de: Wird gesendet…
es: Enviando…
fr: Envoi…
ja: 送信中…
ko: 보내는 중…
pt_br: Enviando…
ru: Отправка…
vi: Đang gửi…
zh_hans: 正在发送…
zh_hant: 正在傳送…

source: Sessions
ar: الجلسات
de: Sitzungen
es: Sesiones
fr: Séances
ja: セッション
ko: 세션
pt_br: Sessões
ru: Сессии
vi: Buổi tập
zh_hans: 练习次数
zh_hant: 練習次數

source: Share class code
ar: مشاركة رمز الصف
de: Kurscode teilen
es: Compartir código de clase
fr: Partager le code de classe
ja: クラスコードを共有
ko: 수업 코드 공유
pt_br: Compartilhar código da turma
ru: Поделиться кодом класса
vi: Chia sẻ mã lớp
zh_hans: 分享班级代码
zh_hant: 分享班級代碼
